benchmarks/results/20260826T1914Z_v028_upgrade/v0271-control-quick/logs/decode_in256_out256_c2_r1.log
INFO 08-26 19:30:53 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-26 19:30:53 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 08-26 19:30:53 [interface.py:247] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(trust_remote_code=False, seed=20274321, num_prompts=4, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='Qwen3.8-27B', input_len=256, output_len=256, tokenizer='/nvme/lexar-2/ai/models/Qwen3.8-27B-Quark-AWQ-MXFP4-amd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['config=v0271-control-mxfp4-dflash-k7', 'workload=decode', 'input_tokens=256', 'output_tokens=256', 'repetition=1', 'tp=2', 'spec=on', 'cpu_offload_gb=0', 'seed=20274321', 'temperature=0'], result_dir=None, result_filename='/nvme/ediloca-1/source/Sayou_GitLab/vllm-radiance/benchmarks/results/20260826T1914Z_v028_upgrade/v0271-control-quick/raw/decode_in256_out256_c2_r1.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-f40ed742-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-26 19:30:54 [utils.py:90] Sampling input_len from [256, 256] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     4         
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  3.70      
Total input tokens:                      1024      
Total generated tokens:                  1024      
Request throughput (req/s):              1.08      
Output token throughput (tok/s):         276.82    
Peak output token throughput (tok/s):    62.00     
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          553.63    
---------------Time to First Token----------------
Mean TTFT (ms):                          146.73    
Median TTFT (ms):                        145.85    
P50 TTFT (ms):                           145.85    
P90 TTFT (ms):                           186.69    
P95 TTFT (ms):                           195.40    
P99 TTFT (ms):                           202.37    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.23      
Median TPOT (ms):                        6.26      
P50 TPOT (ms):                           6.26      
P90 TPOT (ms):                           7.26      
P95 TPOT (ms):                           7.41      
P99 TPOT (ms):                           7.54      
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.25     
Median ITL (ms):                         32.20     
P50 ITL (ms):                            32.20     
P90 ITL (ms):                            32.48     
P95 ITL (ms):                            32.70     
P99 ITL (ms):                            113.43    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1734.40   
Median E2EL (ms):                        1744.09   
P50 E2EL (ms):                           1744.09   
P90 E2EL (ms):                           2013.87   
P95 E2EL (ms):                           2045.48   
P99 E2EL (ms):                           2070.77   
---------------Speculative Decoding---------------
Acceptance rate (%):                     62.75     
Acceptance length:                       5.39      
Drafts:                                  191       
Draft tokens:                            1337      
Accepted tokens:                         839       
Per-position acceptance (%):
  Position 0:                            83.25     
  Position 1:                            72.77     
  Position 2:                            67.54     
  Position 3:                            61.26     
  Position 4:                            56.02     
  Position 5:                            50.79     
  Position 6:                            47.64     
==================================================